{
  "card": [
    {
      "id": 0,
      "titleLineOne": "import React",
      "titleLineTwo": "form",
      "titleBolded": "React",
      "subTitle": "Front-End",
      "content": "In the 7 years of my software engineering experience, I acquired special set of skills in React. Skills that make me a night mirror for bugs. I will look for the bugs and I will fix the bugs. <NotFromTaken/>"
    },
    {
      "id": 1,
      "titleLineOne": "select Me",
      "titleLineTwo": "form",
      "titleBolded": "Database",
      "subTitle": "Database",
      "content": "In every project I have been apart of I have wrote hundreds lines of data base querys, function and procedure. Experience = 7 years "
    },
    {
      "id": 2,
      "titleLineOne": "const app=",
      "titleLineTwo": "require",
      "titleBolded": "(Express)",
      "subTitle": "Back-End",
      "content": "Ever since the rise of Node JS, switching from PHP to to NodeJS made to possible to deploy rebust application. Experience = 7 years"
    }
  ],
  "navigation": {
    "centerContent": [
      {
        "id": 1,
        "itemName": "Resume",
        "link": "/resume",
        "onClick": ""
      }
    ],
    "rightContent": [
      {
        "id": 1,
        "lightIcon": "images/icons/GitHubForDark.svg",
        "darkIcon": "images/icons/GitHub.svg",
        "width": 20,
        "link": "",
        "onClick": ""
      },
      {
        "id": 2,
        "lightIcon": "images/icons/linkedin.svg",
        "darkIcon": "images/icons/linkedinFoDark.svg",
        "width": 20,
        "link": "",
        "onClick": ""
      },
      {
        "id": 3,
        "lightIcon": "images/icons/npm.svg",
        "darkIcon": "images/icons/npm.svg",
        "width": 40,
        "link": "",
        "onClick": ""
      }
    ]
  },
  "resume": [
    {
      "companie": "ZFN Consulting",
      "logo": "images/logo/ZFNLogo.png",
      "positionTitle": "Software Engineer",
      "date": "June 2020 – Current",
      "resumeList": [
        "Developed web applications using React, NodeJS MongoDB and Shell Script.",
        "Created and implemented new features on company website using React, Redux, and Node.js.",
        "Developed middleware for express servers to process API requests.  ",
        "Implemented Json Web Token to authenticate and authorize user on express servers for internal application.",
        "Designed and implemented scalable solutions for data storage with the use of SQ databases such as Postgres and MySQL.",
        "Developed UI/UX interfaces while keeping Web Content Accessibility Guideline (WCAG) standards for internal sites. ",
        "Developed and implemented SQL functions and procedures.",
        "Deployed applications on AWS S3 Bucket and EC2 instance. ",
        "Configured NGINX to deliver dynamic/static content and to serve as a load balancer.",
        "Implemented automated tests to ensure code quality and reliability in accordance with best practices.",
        "Collaborated closely with other developers on projects that required multiple departments and people to complete tasks.",
        "Developed and integrated CRUD operation for relational database.",
        "Created Standard Operating Procedures (SOP’s) and technical documents for system architecture, components, automation programs, and based on the business requirements and needs. ",
        "Collaborated with Project Managers and Business Analyst (BA) to understand the business design, requirements and needs for the wire-framing in preparation for Federal clients."
      ]
    },
    {
      "companie": "BAE System",
      "logo": "images/logo/BAELogo.svg",
      "positionTitle": "Software Engineer",
      "date": "October 2019 – May 2020",
      "resumeList": [
        "Tailored markup languages such as HTML, JavaScript, React, and Angular to produce user-friendly interface components for applications by analyzing user requirements.",
        "Pioneered proprietary COTS through evaluation of requirements from stake holders, users, and SSP Project Managers.",
        "Redesigned and assembled an internal repository to store classified and unclassified NAVY-SSP Documents and a pipeline for access management documentation. ",
        "Designed, assembled, and maintained full-stack web-based applications within an Agile development environment including monthly sprints, daily standups, and monthly scrum meetings. ",
        "Developed UI/UX interfaces while keeping Web Content Accessibility Guideline (WCAG) standards for internal sites.",
        "Spearheaded the development and maintained custom components and widgets for internal and external client facing proprietary software interface.",
        "Automate development operations such as code reviews and code deployments through developing and fostering shell script files. Integrated and developed Express REST API services utilizing ExpressJS.",
        "Created Standard Operating Procedures (SOP’s) and technical documents for system architecture, components, automation programs, and based on the client and business requirements and needs. ",
        "Pioneered and assembled and enhanced continuous integration and deployment using Jenkins, Gerrit, Git, and shell scripts while adhering to Change Management/Release Management Protocols."
      ]
    },
    {
      "companie": "Eagle Hill Consulting",
      "logo": "images/logo/EagleHillConsulting.svg",
      "positionTitle": "Web Developer",
      "date": "March 2019 – April 2019",
      "resumeList": [
        "Collaborated with Project Managers and Business Analyst (BA) to understand the business design, requirements and needs for the wireframing in preparation for Federal webservices. ",
        "Organized managed and deployed application repositories to AWS.",
        "Supported team with maintenance of production websites using Federal services, and JavaScript API, while making CIO website mobile friendly.",
        "Leveraged HTML, CSS, and JavaScript to meet the web application requirements and business needs. ",
        "Continuously uploaded and fostered federal blogs utilizing Markup HTML and CSS.  ",
        "Utilize Adobe XD to develop wireframes for the Federal proprietary website to meet the stakeholder requirements. ",
        "Subject Matter Expert (SME) for Chief Information Officer (CIO’s) during the Analysis, Design, and development phase of the CIO.gov website. ",
        "Consulted and supported stakeholders with capacity planning for the CIO.gov website.  ",
        "Coordinate input from other components in order to design detailed programs and websites. ",
        "Supported less experienced colleagues in identifying, understanding, and resolving programming issues and/or concerns through guidance and fostering.",
        "Complied with the Web Content Accessibility Guidelines (WCAG) in the design and implementation of the CIO.gov website."
      ]
    },
    {
      "companie": "Flex L.L.C",
      "logo": "images/logo/flexLogo.svg",
      "positionTitle": "Software Developer",
      "date": "March 2017 – February 2019",
      "resumeList": [
        "Programed in HTML, CSS, JavaScript, PHP and MySQL to create appealing responsive websites. ",
        "Developed and updated the Flex internal website. ",
        "Evaluated the Web tasks and techniques across all lines of company.",
        "Created, modified and improved web page design and layouts.",
        "Established and maintained effective risk mitigation procedures. ",
        "Advised internal groups on all issues relating to the web site and best next steps. ",
        "Collaborated with design team to create and enhance HTML templates and wireframes."
      ]
    }
  ]
}